tap "anthropic-sdk-cli"
tap "dopplerhq/cli"

# Core
brew "git"
brew "curl"
brew "wget"
brew "zsh"

# CLI Tools
brew "starship"
brew "fnm"
brew "eza"
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "jq"

# Development
brew "node"
brew "pnpm"

# Linters & Formatters
brew "shellcheck"
brew "yamllint"
brew "hadolint"

# Git
brew "gh"
brew "git-delta"
brew "lazygit"

# System
brew "btop"
brew "zoxide"
brew "tldr"

# Docker
brew "docker"
brew "docker-compose"
brew "docker-buildx"

# Neovim
cask "neovim-nightly"

# Claude Code & Doppler
cask "anthropic-sdk-cli"
brew "doppler"